P2/practica2.org
#+TITLE:     Descripción de Autores y Casos de Uso
#+AUTHOR:    Laura Gómez Garrido, Daniel Pozo Escalona\\
#+AUTHOR:    Luis Ortega Andrés, Javier Sáez Maldonado



* Casos de Uso

|---------------+----------------------------------------------------------------------------------------------------------------|
| Caso de Uso   | Caso1                  \vline ID                                                                               |
|---------------+----------------------------------------------------------------------------------------------------------------|
| Actores       | < Participantes>(iniciador)                                                                                    |
|---------------+----------------------------------------------------------------------------------------------------------------|
| Tipo          | (primario,secundario,opcional)(esencial,real)                                                                  |
|---------------+----------------------------------------------------------------------------------------------------------------|
| Referencias   | (Requisitos)                                                                                                   |
|---------------+----------------------------------------------------------------------------------------------------------------|
| Precondicion  | Condiciones para que se pueda realizar el CU                                                                   |
|---------------+----------------------------------------------------------------------------------------------------------------|
| Postcondicion | Efectos que tiene la realizacion del CU                                                                        |
|---------------+----------------------------------------------------------------------------------------------------------------|
| Autor         | <esta linea se podria repetir para mantener una historia de cambios del CU \vline Fecha \vline \version \vline |
|---------------+----------------------------------------------------------------------------------------------------------------|


|-----------------------------------------|
| Proposito                               |
|-----------------------------------------|
| Descripcion general del CU en 1 linea   |
|-----------------------------------------|
                                          

|-------------------------------------------------------------|
| Resumen                                                     |
|-------------------------------------------------------------|
| <Descripcion de alto nivel del flujo normal del caso de uso |
|-------------------------------------------------------------|
                                                              
|--------------+--------------------------+---+----------------------------|
| Curso normal |                          |   |                            |
|--------------+--------------------------+---+----------------------------|
|            1 | Actor 1: accion que hace |   |                            |
|--------------+--------------------------+---+----------------------------|
|            2 | Actor 2: accion que hace | 3 | accion que hace el sistema |
|--------------+--------------------------+---+----------------------------|
|              |                          |   |                            |
|--------------+--------------------------+---+----------------------------|



