P2/practica2.tex
% Created 2018-04-05 jue 18:36
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Laura Gómez Garrido, Daniel Pozo Escalona\\
Luis Ortega Andrés, Javier Sáez Maldonado}
\date{\today}
\title{Descripción de Autores y Casos de Uso}
\hypersetup{
 pdfauthor={Laura Gómez Garrido, Daniel Pozo Escalona\\
Luis Ortega Andrés, Javier Sáez Maldonado},
 pdftitle={Descripción de Autores y Casos de Uso},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents




\section{Casos de Uso}
\label{sec:org51ef979}

\begin{center}
\begin{tabular}{ll}
\hline
Caso de Uso & Caso1                  \vline ID\\
\hline
Actores & < Participantes>(iniciador)\\
\hline
Tipo & (primario,secundario,opcional)(esencial,real)\\
\hline
Referencias & (Requisitos)\\
\hline
Precondicion & Condiciones para que se pueda realizar el CU\\
\hline
Postcondicion & Efectos que tiene la realizacion del CU\\
\hline
Autor & <esta linea se podria repetir para mantener una historia de cambios del CU \vline Fecha \vline \version \vline\\
\hline
\end{tabular}
\end{center}


\begin{center}
\begin{tabular}{l}
\hline
Proposito\\
\hline
Descripcion general del CU en 1 linea\\
\hline
\end{tabular}
\end{center}


\begin{center}
\begin{tabular}{l}
\hline
Resumen\\
\hline
<Descripcion de alto nivel del flujo normal del caso de uso\\
\hline
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{rlrl}
\hline
Curso normal &  &  & \\
\hline
1 & Actor 1: accion que hace &  & \\
\hline
2 & Actor 2: accion que hace & 3 & accion que hace el sistema\\
\hline
 &  &  & \\
\hline
\end{tabular}
\end{center}
\end{document}
